texts = {
    # پیام‌ها
    'start': "سلااام 👋\n\n"
         "خوش اومدی به رفیق دیجیتال خودت! اینجا قراره با هم یه مسیر جدید و هدفمند بسازیم 💪\n"
,

    'start2': "مرسی از وقتی که گذاشتی!\nمی‌تونی از دکمه‌های پایین استفاده کنی یا برای آشنایی بیشتر با امکانات، بزن 👉 /help",

    'help': (
        "اینجا همون جاییه که می‌تونی با یه رفیق دیجیتالی همراه شی تا کارات، اهداف، برنامه‌ها و یادآورها رو قشنگ بچینی سر جاشون 🎯\n\n"
        "تو این ربات می‌تونی:\n"
        "- هدفتو تعریف کنی، منم هر روز یادآوری می‌کنم که بی‌خیالش نشی 💪\n"
        "- برای کارایی که ممکنه یادت بره (مثل قسط، کلاس، جلسه...) یادآور بذاری ⏰\n"
        "- برنامه‌ روزانه‌ت رو ثبت کنی تا همه‌چی منظم و رو روال باشه 🗓️\n"
        "- ازم پیام‌های انگیزشی بگیری تا پرانرژی‌تر ادامه بدی 🔥\n"
        "- گزارش بده که چقدر به هدفات نزدیک شدی و نمره عملکردتو ببین 📊\n"
        "- و حتی باهام درددل کن و ازم مشاوره بگیر، همیشه هستم کنارت 🤝\n\n"
        "با هم برنامه می‌ریزیم، با هم جلو می‌ریم!\n"
        "امیدوارم با کمک من بتونی یه نسخه بهتر از خودت بسازی ✨\n"
        "پس بزن بریم رفیق! 🚀"
    ),

    'goal': 'بخش 🎯 اهداف جاییه که می‌تونی هدف‌هات رو مشخص کنی، پیگیری کنی و با قدرت جلو بری 💪\nبزن بریم برای فتح قله‌ها! 🏔️',
    'reminder': 'یادآور ⏰ رفیق همیشگیته که هیچ کاری رو از یادت نبره! 📝🔔\nدیگه نگران فراموشی نباش، من کنارت هستم!',
    'daily_plan': 'برنامه روزانه 🗓️ کمک می‌کنه روزهات رو مدیریت کنی و همیشه منظم بمونی ✨\nوقتشه که بهترین نسخه خودت باشی!',
    'motive': 'پیام‌های انگیزشی 💬 هر روز بهت انرژی میدن تا از پا نیفتی! ⚡️\nمی‌تونی تنظیمشون کنی یا هر وقت خواستی خاموششون کنی 😉',
    'score': 'تو بخش 📊 نتایج امتیاز، عملکردت رو ببین و پیشرفتت رو جشن بگیر! 🎉\nبا آمار دقیق، بهتر و قوی‌تر پیش برو 📈',
    'account': 'مدیریت حساب 👤 جاییه که اطلاعات شخصیت رو ثبت، ویرایش یا حذف می‌کنی 🔧\nاطلاعاتتو همین‌جا کنترل کن و همیشه بروز باش!',
    'back': 'سلام {}! 😊\nبا این دکمه‌ها می‌تونی به بخش‌های مختلف بری و کارات رو راحت‌تر کنی 👇',

    'service' : ' بزن بریم رفیق 🫡',
    'btn_goal': '🎯 اهداف',
    'btn_reminder': '⏰ یادآور',
    'btn_daily': '📝 برنامه روزانه',
    'btn_motive': '💬 پیام‌های انگیزشی',
    'btn_score': '📊 نتایج امتیاز',
    'btn_account': '👤 مدیریت حساب',
    'btn_back': '🔙 بازگشت',
    'unvan' : "عنوان",
    'mohlat' : 'مهلت',
    'zaman' : 'زمان',
    'tarikh' : "تاریخ",
    'desc' : 'توضیحات',
    'false' : "لطفا به فرمت صحیح وارد کنید",
    
    'goal_add': '➕ اضافه کردن هدف جدید',
    'goal_remove': '🗑️ حذف هدف قبلی',
    'goal_edit': '✏️ ویرایش هدف‌ها',
    'goal_show': '📋 دیدن فهرست اهداف',
    'goal_report': '📈 گزارش پیشرفت اهداف',

    
    'reminder_add': '➕ یادآور جدید اضافه کن',
    'reminder_remove': '🗑️ حذف یادآور',
    'reminder_edit': '✏️ ویرایش یادآورها',
    'reminder_show': '📋 نمایش همه یادآورها',
    'reminder_report': '📈 گزارش فعالیت‌های یادآور',

    
    'daily_add': '➕ برنامه جدید ثبت کن',
    'daily_remove': '🗑️ حذف برنامه روزانه',
    'daily_edit': '✏️ ویرایش برنامه‌ها',
    'daily_show': '📋 دیدن برنامه‌های روزانه',
    'daily_report': '📈 گزارش پیشرفت برنامه‌ها',

    
    'motive_activate': '✅ روشن کردن پیام‌های انگیزشی',
    'motive_deactivate': '🚫 خاموش کردن پیام‌ها',
    'motive_edit': '⏰ تغییر زمان ارسال پیام‌ها',

    
    'score_goal': '🎯 امتیاز اهداف',
    'score_reminder': '⏰ امتیاز یادآورها',

    
    'account_add': '➕ افزودن اطلاعات جدید',
    'account_show': '📋 نمایش اطلاعات حساب',
    'account_edit': '✏️ ویرایش اطلاعات شخصی',
    'account_remove': '🗑️ حذف اطلاعات ثبت شده', 





    'goal1': 'گزینه هدف انتخاب شد',
    'reminder1': 'گزینه یادآور انتخاب شد',
    'daily1': 'گزینه برنامه روزانه انتخاب شد',
    'motive1': 'گزینه پیام انگیزشی انتخاب شد',
    'score1': 'گزینه نتیجه امتیاز انتخاب شد',
    'account1': 'گزینه مدیریت حساب انتخاب شد',


    'goal_add1': 'گزینه افزودن هدف انتخاب شد',
    'goal_remove1': 'گزینه حذف هدف انتخاب شد',
    'goal_edit1': 'گزینه ویرایش هدف انتخاب شد',
    'goal_show1': 'گزینه نمایش هدف انتخاب شد',
    'goal_report1': 'گزینه گزارش هدف انتخاب شد',
    'back1': 'گزینه بازگشت انتخاب شد',
    'callback_back1': '🔙 برگشت به منوی قبلی انجام شد. هر وقت آماده بودی یکی از گزینه‌ها رو انتخاب کن 😊',

    'reminder_add1': 'گزینه افزودن یادآور انتخاب شد',
    'reminder_remove1': 'گزینه حذف یادآور انتخاب شد',
    'reminder_edit1': 'گزینه ویرایش یادآور انتخاب شد',
    'reminder_show1': 'گزینه نمایش یادآورها انتخاب شد',
    'reminder_report1': 'گزینه گزارش یادآور انتخاب شد',

    'daily_add1': 'افزودن برنامه روزانه انتخاب شد',
    'daily_remove1': 'حذف برنامه روزانه انتخاب شد',
    'daily_edit1': 'ویرایش برنامه روزانه انتخاب شد',
    'daily_show1': 'نمایش برنامه‌های روزانه انتخاب شد',
    'daily_report1': 'گزارش برنامه روزانه انتخاب شد',

    'goal_scores': 'گزینه امتیاز اهداف انتخاب شد',
    'reminder_scores': 'گزینه امتیاز یادآورها انتخاب شد',

    'motive_activate1': ' فعال‌سازی پیام انتخاب شد',
    'motive_deactivate1': ' غیرفعال‌سازی پیام انتخاب شد',
    'edit_send_time1': ' ویرایش زمان ارسال انتخاب شد',

    'add_info1': 'گزینه افزودن اطلاعات انتخاب شد',
    'show_info1': 'گزینه نمایش اطلاعات انتخاب شد',
    'edit_info1': 'گزینه ویرایش اطلاعات انتخاب شد',
    'remove_info1': 'گزینه حذف اطلاعات انتخاب شد',

    




    'goal_ask_title': '🏁 لطفاً عنوان هدف خود را وارد کنید:',
    'goal_ask_description': '📝 توضیح کوتاهی درباره این هدف بده (اختیاری):',
    'goal_ask_deadline': '📆 مهلت یا تاریخ نهایی این هدف را بنویس (مثلاً: 1403/06/01):',
    'goal_saved': '✅ هدف با موفقیت ذخیره شد! عالیه که داری روی هدفت کار می‌کنی 💪',
    'goal_ask_edit': '✏️ لطفاً اطلاعات جدید هدف را وارد کن:',
    'goal_ask_remove': '🗑️ آیدی هدفی که می‌خوای حذف بشه رو وارد کن:',
    'goal_ask_edit': '🗑️ آیدی هدفی که می‌خوای ادیت بشه رو وارد کن:',
    'goal_show_msg': '👇🏼📋 این لیست اهداف فعلی شماست:',
    'goal_edited' : "هدف مورد نظر ادیت شد☺",
    'goal_report_msg': '📊 در حال تهیه گزارش وضعیت اهداف هستم... صبر کن لطفاً 😊',
    'goal_removed' : "هدف مورد نظر با موفقیت حذف شد☺",

    'reminder_ask_title': '🕰️ لطفاً عنوان یادآور را وارد کنید:',
    'reminder_ask_date': '📅 حالا تاریخ یادآور را وارد کنید (مثلاً: 1403/05/22):',
    'reminder_ask_time': '⏳ لطفاً ساعت یادآور را بنویس (مثلاً: 14:30):',
    'reminder_saved': '✅ یادآور ذخیره شد! خیالت راحت، من به موقع یادت می‌ندازم 😎',
    'reminder_ask_edit': '🔧 لطفاً اطلاعات جدید یادآور را وارد کن:',
    'reminder_ask_remove': '❌ عنوان یادآوری که می‌خوای حذف کنی رو وارد کن:',
    'reminder_show_msg': '📋 لیست یادآورهای شما اینه:',
    'reminder_report_msg': '📊 دارم یه گزارش کامل از یادآورهات آماده می‌کنم...',
    'stop' : 'اکه کارات تموم شد دکمه توقف رو بزن 😊',
    'btn_stop' :'✋ توقف',
    'notask' : "هیچ کاری ثبت نشده." ,
    'next_task' : "کار ذخیره شد. کار بعدی رو بنویس یا توقف رو بزن:",
    'daily_ask_task' : '📝 لطفاً عنوان کاری که هرروز باید انجام بدی رو برام بفرست:',
    'daily_ask_time': '⏰ حالا ساعتی که می‌خوای این کار برات یادآوری بشه رو بنویس (مثلاً: 14:30):',
    'daily_task_saved': '✅ کارت با موفقیت ذخیره شد! من سر ساعت بهت یادآوری می‌کنم ',
    'daily_ask_edit': '✏️ لطفاً عنوان کاری که می‌خوای ویرایش کنی رو بفرست:',
    'daily_ask_edit_new_info': '🔁 حالا اطلاعات جدیدش رو بنویس (عنوان و ساعت جدید):',
    'daily_ask_remove': '🗑️ لطفاً عنوان کاری که می‌خوای حذف کنی رو وارد کن:',
    'daily_show_msg': '📋 این لیست برنامه‌ریزی‌ات برای امروز هست:\n(اگه خواستی ویرایش یا حذفشون کنی، از منو استفاده کن)',
    'daily_report_msg': '📊 دارم یه گزارش از برنامه‌هات آماده می‌کنم...',
    'daily_reminder_msg': '⏰ یادآوری: الان وقتشه که این کار رو انجام بدی 👇\n📌 {task_title}',

    'motive_activate_msg': '✅ پیام‌های انگیزشی فعال شدن! هر روز یه جرقه مثبت برات دارم ✨',
    'motive_deactivate_msg': '🔕 پیام‌های انگیزشی غیرفعال شدن. هر وقت خواستی، دوباره روشنشون کن 😉',
    'motive_edit_time': '⏰ لطفاً زمانی که دوست داری پیام انگیزشی برات ارسال بشه رو وارد کن (مثلاً: 09:00):',
    'motive_service_text': '🛠️ سرویس پیام‌های انگیزشی تنظیم شد. همه‌چی آمادست! 🚀',

    'score_select_option': '📈 لطفاً یکی از گزینه‌های زیر رو برای مشاهده امتیاز انتخاب کن:',
    'score_goal_result': '🎯 امتیاز فعلی شما برای اهداف:',
    'score_reminder_result': '⏰ امتیاز شما بر اساس دقت در یادآورها:',

    'account_ask_add': '➕ لطفاً اطلاعات حساب جدید رو وارد کن:',
    'account_show_info': '📋 اطلاعات حساب شما به شرح زیر است:',
    'account_ask_edit': '✏️ لطفاً اطلاعات جدید برای حساب خود را وارد کنید:',
    'account_ask_remove': '🗑️ آیا مطمئنی که می‌خوای حساب رو حذف کنی؟ (بنویس "تأیید")',
    'your_goal_id': 'شناسه هدف شما:',
    'your_reminder_id': 'شناسه یادآور شما:',
    'start1' : " رفیق لطفا اسم کامل خودت رو وارد کن:😉",
    'start22' : "لطفا سنت رو هم وارد کن ممنون 😊",
    'goal_desc'  : "متن هدف",
    'id' : "آیدی",
    'title' : "عنوان",
    'no_goal' : "⚠️هدفی ثبت نشده است",
    'your_goals' : "اهداف شما👆🏼👆🏼",
    'date': "زمان"
}